In [1]:
import json
import cx_Oracle

%load_ext sql
%sql oracle+cx_oracle://arup:arup@192.168.29.71:1521/?service_name=testpdb1.localdomain

In [2]:
%%sql result <<
select *from dept

 * oracle+cx_oracle://arup:***@192.168.29.71:1521/?service_name=testpdb1.localdomain
0 rows affected.
Returning data to local variable result

In [3]:
df = result.DataFrame()
df.head()

   deptno       dname       loc
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON